{"class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 215, 215, 1], "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "dtype": "float32", "activity_regularizer": null, "strides": [2, 2], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "kernel_size": [5, 5], "padding": "valid", "name": "conv2d_30", "filters": 32, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "kernel_size": [5, 5], "activity_regularizer": null, "strides": [2, 2], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "name": "conv2d_31", "filters": 64, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "kernel_size": [5, 5], "activity_regularizer": null, "strides": [2, 2], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activation": "linear", "padding": "valid", "name": "conv2d_32", "filters": 128, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "dtype": "float32", "name": "flatten_10", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "units": 128, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "name": "dense_20", "use_bias": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "units": 2, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activation": "softmax", "name": "dense_21", "use_bias": true}}], "name": "sequential_10"}, "keras_version": "2.2.4-tf"}