{"config": {"name": "sequential", "layers": [{"config": {"kernel_constraint": null, "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d", "strides": [2, 2], "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "batch_input_shape": [null, 215, 215, 1], "filters": 32, "activation": "linear", "data_format": "channels_last", "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_1", "strides": [2, 2], "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "padding": "valid", "filters": 64, "activation": "linear", "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_2", "strides": [2, 2], "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "padding": "valid", "filters": 128, "activation": "linear", "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "name": "flatten", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "name": "dense", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "activation": "linear", "trainable": true, "units": 128, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"dtype": "float32", "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization", "trainable": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": [1], "gamma_constraint": null, "scale": true, "beta_regularizer": null, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "name": "re_lu", "trainable": true, "negative_slope": 0.0, "max_value": null, "threshold": 0.0}, "class_name": "ReLU"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "name": "dense_1", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "activation": "sigmoid", "trainable": true, "units": 2, "activity_regularizer": null}, "class_name": "Dense"}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow", "class_name": "Sequential"}