{"class_name": "Sequential", "keras_version": "2.2.4-tf", "backend": "tensorflow", "config": {"layers": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "name": "conv2d", "kernel_constraint": null, "trainable": true, "padding": "valid", "filters": 32, "activation": "linear", "strides": [2, 2], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "use_bias": true, "kernel_size": [5, 5], "batch_input_shape": [null, 215, 215, 1], "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2d_1", "kernel_constraint": null, "trainable": true, "padding": "valid", "filters": 64, "activation": "linear", "strides": [2, 2], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "use_bias": true, "kernel_size": [5, 5], "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2d_2", "kernel_constraint": null, "trainable": true, "padding": "valid", "filters": 128, "activation": "linear", "strides": [2, 2], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "data_format": "channels_last", "dilation_rate": [1, 1], "use_bias": true, "kernel_size": [5, 5], "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "dtype": "float32", "data_format": "channels_last", "name": "flatten"}}, {"class_name": "Dense", "config": {"dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "dtype": "float32", "gamma_regularizer": null, "name": "batch_normalization", "momentum": 0.99, "trainable": true, "axis": [1], "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "ReLU", "config": {"dtype": "float32", "negative_slope": 0.0, "name": "re_lu", "threshold": 0.0, "trainable": true, "max_value": null}}, {"class_name": "Dense", "config": {"dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_1", "kernel_constraint": null, "trainable": true, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null}}], "name": "sequential"}}