{"config": {"name": "sequential", "layers": [{"config": {"name": "conv2d", "dilation_rate": [1, 1], "kernel_size": [5, 5], "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "padding": "valid", "batch_input_shape": [null, 215, 215, 1], "kernel_constraint": null, "bias_regularizer": null, "strides": [2, 2], "activity_regularizer": null, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_1", "bias_regularizer": null, "kernel_size": [5, 5], "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "strides": [2, 2], "activity_regularizer": null, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_2", "bias_regularizer": null, "kernel_size": [5, 5], "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "strides": [2, 2], "activity_regularizer": null, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "flatten", "trainable": true, "data_format": "channels_last", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"name": "dense", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "batch_normalization", "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "dtype": "float32", "scale": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": [1], "trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "re_lu", "max_value": null, "trainable": true, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32"}, "class_name": "ReLU"}, {"config": {"name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 2, "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "sigmoid", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4-tf", "backend": "tensorflow"}