{"config": {"layers": [{"config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [2, 2], "activity_regularizer": null, "activation": "linear", "batch_input_shape": [null, 215, 215, 1], "kernel_size": [5, 5], "name": "conv2d_6", "trainable": true, "use_bias": true, "filters": 32, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [2, 2], "activity_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_size": [5, 5], "name": "conv2d_7", "padding": "valid", "use_bias": true, "filters": 64, "trainable": true}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [2, 2], "activity_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_size": [5, 5], "name": "conv2d_8", "padding": "valid", "use_bias": true, "filters": 128, "trainable": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "flatten_2", "trainable": true, "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "name": "dense_4", "units": 128, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "name": "dense_5", "units": 2, "use_bias": true}, "class_name": "Dense"}], "name": "sequential_2"}, "class_name": "Sequential", "keras_version": "2.2.4-tf", "backend": "tensorflow"}