{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"name": "sequential_3", "layers": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "trainable": true, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "activity_regularizer": null, "dtype": "float32", "name": "conv2d_9", "filters": 32, "bias_regularizer": null, "batch_input_shape": [null, 215, 215, 1], "data_format": "channels_last", "kernel_size": [5, 5], "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "bias_constraint": null, "kernel_size": [5, 5], "use_bias": true, "strides": [2, 2], "activity_regularizer": null, "name": "conv2d_10", "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "bias_constraint": null, "kernel_size": [5, 5], "use_bias": true, "strides": [2, 2], "activity_regularizer": null, "name": "conv2d_11", "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "dtype": "float32", "activation": "linear", "kernel_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_6", "bias_regularizer": null, "trainable": true, "activation": "linear", "use_bias": true, "units": 128, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "momentum": 0.99, "scale": true, "dtype": "float32", "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": [1], "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true}}, {"class_name": "ReLU", "config": {"name": "re_lu_3", "max_value": null, "negative_slope": 0.0, "trainable": true, "dtype": "float32", "threshold": 0.0}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_7", "bias_regularizer": null, "trainable": true, "activation": "sigmoid", "use_bias": true, "units": 2, "kernel_constraint": null}}]}}