{"keras_version": "2.2.4-tf", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"filters": 32, "name": "conv2d", "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "trainable": true, "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "strides": [2, 2], "batch_input_shape": [null, 215, 215, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "use_bias": true}}, {"class_name": "Conv2D", "config": {"filters": 64, "name": "conv2d_1", "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "trainable": true, "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "strides": [2, 2], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "use_bias": true}}, {"class_name": "Conv2D", "config": {"filters": 128, "name": "conv2d_2", "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "trainable": true, "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "strides": [2, 2], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "use_bias": true}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "dtype": "float32", "name": "flatten", "trainable": true}}, {"class_name": "Dense", "config": {"units": 128, "kernel_constraint": null, "name": "dense", "activation": "relu", "bias_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "trainable": true, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "use_bias": true}}, {"class_name": "Dense", "config": {"units": 2, "kernel_constraint": null, "name": "dense_1", "activation": "softmax", "bias_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "trainable": true, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "use_bias": true}}], "name": "sequential"}, "backend": "tensorflow"}