{"keras_version": "2.2.4-tf", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "filters": 32, "dtype": "float32", "bias_constraint": null, "name": "conv2d", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "strides": [2, 2], "activation": "linear", "batch_input_shape": [null, 215, 215, 1], "padding": "valid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_size": [5, 5], "kernel_constraint": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "filters": 64, "dtype": "float32", "bias_constraint": null, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "strides": [2, 2], "activation": "linear", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "valid", "use_bias": true, "kernel_size": [5, 5], "kernel_constraint": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "filters": 128, "dtype": "float32", "bias_constraint": null, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "strides": [2, 2], "activation": "linear", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "valid", "use_bias": true, "kernel_size": [5, 5], "kernel_constraint": null, "trainable": true}}, {"class_name": "Flatten", "config": {"dtype": "float32", "name": "flatten", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 128, "dtype": "float32", "bias_constraint": null, "name": "dense", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "use_bias": true, "kernel_constraint": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "name": "batch_normalization", "beta_regularizer": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "axis": [1], "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"class_name": "ReLU", "config": {"max_value": null, "negative_slope": 0.0, "threshold": 0.0, "dtype": "float32", "name": "re_lu", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 2, "dtype": "float32", "bias_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "sigmoid", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "use_bias": true, "kernel_constraint": null, "trainable": true}}], "name": "sequential"}, "backend": "tensorflow"}