{"keras_version": "2.2.4-tf", "backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"filters": 32, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_size": [5, 5], "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "trainable": true, "padding": "valid", "name": "conv2d_6", "use_bias": true, "batch_input_shape": [null, 215, 215, 1], "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"filters": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_size": [5, 5], "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "trainable": true, "padding": "valid", "name": "conv2d_7", "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"filters": 128, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_size": [5, 5], "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "trainable": true, "padding": "valid", "name": "conv2d_8", "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_2", "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "use_bias": true, "units": 128, "bias_constraint": null, "trainable": true, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_5", "use_bias": true, "units": 2, "bias_constraint": null, "trainable": true, "bias_regularizer": null}}], "name": "sequential_2"}}