{"backend": "tensorflow", "config": {"name": "sequential_11", "layers": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_constraint": null, "trainable": true, "dtype": "float32", "bias_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [5, 5], "activation": "linear", "batch_input_shape": [null, 215, 215, 1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "strides": [2, 2], "name": "conv2d_33", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_constraint": null, "trainable": true, "dtype": "float32", "bias_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [5, 5], "use_bias": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "name": "conv2d_34", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_constraint": null, "trainable": true, "dtype": "float32", "bias_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [5, 5], "use_bias": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "name": "conv2d_35", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"class_name": "Flatten", "config": {"name": "flatten_11", "data_format": "channels_last", "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "dtype": "float32", "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "units": 128, "use_bias": true, "kernel_regularizer": null, "name": "dense_22", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"class_name": "BatchNormalization", "config": {"scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "dtype": "float32", "gamma_regularizer": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": [1], "name": "batch_normalization_11", "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ReLU", "config": {"trainable": true, "dtype": "float32", "threshold": 0.0, "name": "re_lu_11", "max_value": null, "negative_slope": 0.0}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "dtype": "float32", "bias_constraint": null, "activation": "sigmoid", "activity_regularizer": null, "units": 2, "use_bias": true, "kernel_regularizer": null, "name": "dense_23", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}]}, "class_name": "Sequential", "keras_version": "2.2.4-tf"}