{"config": {"name": "sequential_6", "layers": [{"config": {"dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_6", "padding": "valid", "bias_constraint": null, "filters": 32, "batch_input_shape": [null, 28, 28, 1], "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_6", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_6", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "name": "dense_12", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "units": 32, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "name": "dense_13", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "units": 10, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4-tf"}