{"keras_version": "2.2.4-tf", "backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "use_bias": true, "dtype": "float32", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_4", "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "dtype": "float32", "name": "max_pooling2d_4", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_4", "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 32, "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_8"}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 10, "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "softmax", "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_9"}}], "name": "sequential_4"}}